96a97
> a              funOne    var      int         2  5 
98a100
> y              main      var      int        10 11 
101,102d102
< a              funOne    var      int         2  5 
< b              funOne    var      int         3  4  5 
104c104
< y              main      var      int        10 11 
---
> b              funOne    var      int         3  4  5 
108a109,110
> 
> Checking for main...
115a118
>   4:     ST  0,-1(2) 	store return address from ac
121a125,163
> * -> Const
>   5:    LDC  0,1(0) 	load const
> * <- Const
>   6:     ST  0,-4(2) 	op: push left
> * -> Op
> * -> Op
> * -> Const
>   7:    LDC  0,5(0) 	load const
> * <- Const
>   8:     ST  0,-5(2) 	op: push left
> * -> Const
>   9:    LDC  0,7(0) 	load const
> * <- Const
>  10:     LD  1,-5(2) 	op: load left
>  11:    MUL  0,1,0 	op *
> * <- Op
>  12:     ST  0,-5(2) 	op: push left
> * -> Const
>  13:    LDC  0,2(0) 	load const
> * <- Const
>  14:     LD  1,-5(2) 	op: load left
>  15:    DIV  0,1,0 	op /
> * <- Op
>  16:     LD  1,-4(2) 	op: load left
>  17:    ADD  0,1,0 	op +
> * <- Op
>  18:     ST  0,-3(2) 	assign: store value
> * <- assign
> * -> assign
> * -> Op
> * -> Id
>  19:     LD  0,-3(2) 	load id value
> * <- Id
>  20:     ST  0,-4(2) 	op: push left
> * -> Const
>  21:    LDC  0,4(0) 	load const
> * <- Const
>  22:     LD  1,-4(2) 	op: load left
>  23:    ADD  0,1,0 	op +
123,124c165
< * TESTANDO NOME ESCOPO: global
<   3:     ST  0,-3(2) 	assign: store value
---
>  24:     ST  0,-2(2) 	assign: store value
125a167,176
>  25:    LDA  1,0(2) 	save current fp into ac1
>  26:     LD  2,0(2) 	make fp = ofp
>  27:     LD  7,-1(1) 	return to caller
> * <- End Function
> * -> Init Function (main)
>   3:    LDA  7,24(7) 	jump to main
> * -> declare var
> * <- declare var
> * -> declare var
> * <- declare var
127a179,187
> * -> Id
>  28:     LD  0,-2(2) 	load id value
> * <- Id
>  29:     ST  0,-4(2) 	op: push left
> * -> Const
>  30:    LDC  0,1(0) 	load const
> * <- Const
>  31:     LD  1,-4(2) 	op: load left
>  32:    ADD  0,1,0 	op +
129,130c189
< * TESTANDO NOME ESCOPO: global
<   4:     ST  0,-2(2) 	assign: store value
---
>  33:     ST  0,-3(2) 	assign: store value
134c193
<   5:   HALT  0,0,0 	
---
>  34:   HALT  0,0,0 	
